In [2]:
#pd is alias name
import pandas as pd

In [3]:
# Two main datatypes in pandas
cars = pd.Series(["BMW", "Toyota", "Honda"])

In [4]:
cars

0       BMW
1    Toyota
2     Honda
dtype: object

In [5]:
# Series is data type in panda library having one dimensional

In [6]:
colors = pd.Series(["Red", "Blue", "Green"])

In [7]:
colors

0      Red
1     Blue
2    Green
dtype: object

In [8]:
# Dataframe is data type in panda library having two dimensional

In [9]:
car_data = pd.DataFrame({"Car Manufacturer": cars, "Colors":colors})

In [10]:
car_data

  Car Manufacturer Colors
0              BMW    Red
1           Toyota   Blue
2            Honda  Green

In [11]:
# Importing data from a csv file
car_sales = pd.read_csv("car-sales.csv")

In [12]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

Anatomy of Data frame in Pandas
The 0,1,2,3,4,...,8,9 is the Index number of the data frame starting from 0
Axix 1 signifies the column in the data frame
Axix 0 signifies the row in the data frame

In [13]:
# Exporting a data frame 

# Exporting in csv file
# here the "exported-car-sales.csv" is the name of the file that will be created in project directory
car_sales.to_csv("exported-car-sales.csv")

# Exporting in excel file
car_sales.to_excel("exported-car-sales.xlsx")

In [14]:
# Let us import the exported-car-sales.csv and see if it is working or not

imported_car_sales = pd.read_csv("exported-car-sales.csv")
imported_car_sales

   Unnamed: 0    Make Colour  Odometer (KM)  Doors       Price
0           0  Toyota  White         150043      4   $4,000.00
1           1   Honda    Red          87899      4   $5,000.00
2           2  Toyota   Blue          32549      3   $7,000.00
3           3     BMW  Black          11179      5  $22,000.00
4           4  Nissan  White         213095      4   $3,500.00
5           5  Toyota  Green          99213      4   $4,500.00
6           6   Honda   Blue          45698      4   $7,500.00
7           7   Honda   Blue          54738      4   $7,000.00
8           8  Toyota  White          60000      4   $6,250.00
9           9  Nissan  White          31600      4   $9,700.00

In [15]:
# There are two index column to remove this
car_sales.to_csv("exported-car-sales.csv", index = False )

In [16]:
imported_car_sales = pd.read_csv("exported-car-sales.csv")
imported_car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

## Describe data

Attributes in Python are variables associated with an object and are used to store data related to the object. Methods in Python are functions that are associated with an object, and they are used to perform operations on the object.

The attribute did not have brackets, while method have brackets with parameters

In [17]:
# this is a attribute
# dtypes stands for data types

car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [18]:
#This will tell us our column name
car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [19]:
#Here we are saving the coulumn data in a list named car_columns, we can modify the car_columns and re write the changes in the car_sales.columns  

car_columns = car_sales.columns
car_columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [20]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [21]:
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

The describe() method returns description of the data in the DataFrame.

If the DataFrame contains numerical data, the description contains these information for each column:

count - The number of not-empty values.

mean - The average (mean) value.

std - The standard deviation.

min - the minimum value.

25% - The 25% percentile*.

50% - The 50% percentile*.

75% - The 75% percentile*.

max - the maximum value.


*Percentile meaning: how many of the values are less than the given percentile.

Syntax
dataframe.describe(percentiles, include, exclude, datetime_is_numeric


Parameters
The percentile, include, exclude, datetime_is_numeric parameters are keyword arguments.

Parameter	Value	Description
percentile	numbers betwe
en:
0 and 1	Optional, a list of percentiles to include in the result, default is :
[.25, .50, a
 
a as numeric:

 Return Value
A DataFrame object with statisti

** A thing to notice that it only outputs the odometer and door value because only those two values are integer types and rest of them are object type.
Describe only for the numeric/integer type valuescs for each row.)

In [22]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes





About info() function

The info() method prints information about the DataFrame.
The information contains the number of columns, column labels, column data types, memory usage, range index, and the number of cells in each column (non-null values).

dataframe.info(verbose,buf,max_cols,memory_usage,show_counts,null_counts)


Return Value
None. The info() method does not return any value, it prints the information.

In [23]:
car_sales.mean(numeric_only= 1)

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [24]:
# for selecting one column from a data frame we can
car_sales["Doors"].mean()

4.0

In [25]:
# It tries to sum up all the values it adds them if they are integer type and if they are not integers they are only concatenated
car_sales.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [26]:
# let us look with a example by making a series

# height of 10 student of our class
students_height = pd.Series([144, 160, 169, 171, 154, 175, 156, 160, 162, 167])

# returns the max value from the series or a particular column or for all the columns of a data frame
print(students_height.mean())

# returns the max value
print(students_height.max())

# count the total no of elements in the given column/series
print(students_height.count())

161.8
175
10

## Viewing and selecting data

The head() function in pandas is used to display the first few rows of a DataFrame. This is useful for quickly inspecting the structure and content of your data.

In [27]:
# The default value will show 5 data
car_sales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [28]:
# by passing a value with n parameter we can contol the number of data we wanted to see from top
car_sales.head(n = 2)

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
1   Honda    Red          87899      4  $5,000.00

The tail() function in pandas is used to display the last few rows of a DataFrame.

In [29]:
car_sales.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [30]:
car_sales.tail(3)

     Make Colour  Odometer (KM)  Doors      Price
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [31]:
# .loc and .iloc

anime_list_1 = pd.Series(["Naruto Shippuden", "Demon Slayer", "Jujutsu Kaisen", "Mushoko Tensei", "Death Note"])

In [32]:
anime_list_1

0    Naruto Shippuden
1        Demon Slayer
2      Jujutsu Kaisen
3      Mushoko Tensei
4          Death Note
dtype: object

In [33]:
anime_list_2 = pd.Series(["Black Clover", "Attack on Titan", "One Punch Man", "My Hero Academia", "Tokyo Revengers"])

In [34]:
anime_list_2

0        Black Clover
1     Attack on Titan
2       One Punch Man
3    My Hero Academia
4     Tokyo Revengers
dtype: object